Data/Section 5/5.2/Client/VM2_Instance2/rep1/output_C2_T1_W64_K6_R1.log
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  90 secs]  0 threads:       44954 ops,     557 (avg:     499) ops/sec, 1.98MB/sec (avg: 1.78MB/sec),  3.57 (avg:  3.99) msec latency

1         Threads
2         Connections per thread
90        Seconds


ALL STATS
========================================================================
Type        Ops/sec     Hits/sec   Misses/sec      Latency       KB/sec
------------------------------------------------------------------------
Sets         249.72          ---          ---      3.97100       259.33
Gets         249.72      1498.33         0.00      4.00700      1558.99
Waits          0.00          ---          ---      0.00000          ---
Totals       499.44      1498.33         0.00      3.98900      1818.32


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       1.100         0.03
SET       1.200         0.11
SET       1.300         0.41
SET       1.400         1.20
SET       1.500         2.74
SET       1.600         5.23
SET       1.700         8.61
SET       1.800        12.60
SET       1.900        17.03
SET       2.000        21.11
SET       2.100        25.07
SET       2.200        28.98
SET       2.300        32.34
SET       2.400        35.53
SET       2.500        38.47
SET       2.600        41.14
SET       2.700        43.37
SET       2.800        45.50
SET       2.900        47.23
SET       3.000        48.85
SET       3.100        50.37
SET       3.200        51.72
SET       3.300        52.89
SET       3.400        54.21
SET       3.500        55.38
SET       3.600        56.56
SET       3.700        57.60
SET       3.800        58.62
SET       3.900        59.74
SET       4.000        60.95
SET       4.100        62.00
SET       4.200        62.99
SET       4.300        64.23
SET       4.400        65.38
SET       4.500        66.51
SET       4.600        67.74
SET       4.700        69.12
SET       4.800        70.52
SET       4.900        71.85
SET       5.000        73.06
SET       5.100        74.48
SET       5.200        75.87
SET       5.300        77.07
SET       5.400        78.36
SET       5.500        79.60
SET       5.600        80.84
SET       5.700        82.02
SET       5.800        83.06
SET       5.900        84.08
SET       6.000        84.98
SET       6.100        85.85
SET       6.200        86.64
SET       6.300        87.48
SET       6.400        88.21
SET       6.500        88.81
SET       6.600        89.42
SET       6.700        89.94
SET       6.800        90.39
SET       6.900        90.85
SET       7.000        91.19
SET       7.100        91.56
SET       7.200        91.94
SET       7.300        92.42
SET       7.400        92.69
SET       7.500        93.01
SET       7.600        93.32
SET       7.700        93.60
SET       7.800        93.80
SET       7.900        94.05
SET       8.000        94.27
SET       8.100        94.50
SET       8.200        94.78
SET       8.300        94.97
SET       8.400        95.23
SET       8.500        95.48
SET       8.600        95.67
SET       8.700        95.87
SET       8.800        96.07
SET       8.900        96.21
SET       9.000        96.38
SET       9.100        96.51
SET       9.200        96.62
SET       9.300        96.77
SET       9.400        96.91
SET       9.500        97.01
SET       9.600        97.10
SET       9.700        97.19
SET       9.800        97.32
SET       9.900        97.46
SET      10.000        97.98
SET      11.000        98.44
SET      12.000        98.75
SET      13.000        98.95
SET      14.000        99.15
SET      15.000        99.31
SET      16.000        99.45
SET      17.000        99.60
SET      18.000        99.71
SET      19.000        99.76
SET      20.000        99.82
SET      21.000        99.85
SET      22.000        99.87
SET      23.000        99.92
SET      24.000        99.93
SET      25.000        99.94
SET      26.000        99.94
SET      27.000        99.95
SET      28.000        99.95
SET      30.000        99.96
SET      31.000        99.96
SET      33.000        99.96
SET      34.000        99.97
SET      37.000        99.97
SET      39.000        99.98
SET      40.000        99.98
SET      50.000        99.99
SET      64.000        99.99
SET      86.000       100.00
SET      88.000       100.00
---
GET       1.300         0.00
GET       1.400         0.05
GET       1.500         0.37
GET       1.600         1.26
GET       1.700         3.18
GET       1.800         5.89
GET       1.900         9.90
GET       2.000        14.22
GET       2.100        18.85
GET       2.200        23.25
GET       2.300        27.66
GET       2.400        31.66
GET       2.500        35.39
GET       2.600        38.92
GET       2.700        41.87
GET       2.800        44.69
GET       2.900        46.75
GET       3.000        48.87
GET       3.100        50.93
GET       3.200        52.62
GET       3.300        54.03
GET       3.400        55.52
GET       3.500        56.84
GET       3.600        57.95
GET       3.700        59.08
GET       3.800        60.06
GET       3.900        61.06
GET       4.000        61.97
GET       4.100        62.89
GET       4.200        63.83
GET       4.300        64.73
GET       4.400        65.69
GET       4.500        66.54
GET       4.600        67.49
GET       4.700        68.52
GET       4.800        69.63
GET       4.900        70.78
GET       5.000        72.02
GET       5.100        73.34
GET       5.200        74.62
GET       5.300        75.97
GET       5.400        77.33
GET       5.500        78.56
GET       5.600        79.89
GET       5.700        81.07
GET       5.800        82.46
GET       5.900        83.77
GET       6.000        84.94
GET       6.100        86.11
GET       6.200        86.99
GET       6.300        87.82
GET       6.400        88.71
GET       6.500        89.39
GET       6.600        90.05
GET       6.700        90.64
GET       6.800        91.22
GET       6.900        91.68
GET       7.000        92.10
GET       7.100        92.53
GET       7.200        92.90
GET       7.300        93.30
GET       7.400        93.57
GET       7.500        93.85
GET       7.600        94.11
GET       7.700        94.39
GET       7.800        94.69
GET       7.900        94.95
GET       8.000        95.20
GET       8.100        95.38
GET       8.200        95.54
GET       8.300        95.77
GET       8.400        95.96
GET       8.500        96.17
GET       8.600        96.33
GET       8.700        96.51
GET       8.800        96.71
GET       8.900        96.88
GET       9.000        97.00
GET       9.100        97.13
GET       9.200        97.25
GET       9.300        97.40
GET       9.400        97.53
GET       9.500        97.65
GET       9.600        97.75
GET       9.700        97.79
GET       9.800        97.90
GET       9.900        98.00
GET      10.000        98.32
GET      11.000        98.75
GET      12.000        99.07
GET      13.000        99.26
GET      14.000        99.39
GET      15.000        99.45
GET      16.000        99.54
GET      17.000        99.63
GET      18.000        99.70
GET      19.000        99.76
GET      20.000        99.79
GET      21.000        99.80
GET      22.000        99.82
GET      23.000        99.84
GET      24.000        99.85
GET      25.000        99.86
GET      26.000        99.89
GET      28.000        99.91
GET      29.000        99.91
GET      30.000        99.92
GET      31.000        99.92
GET      32.000        99.94
GET      33.000        99.95
GET      34.000        99.95
GET      40.000        99.96
GET      42.000        99.96
GET      48.000        99.96
GET      49.000        99.97
GET      52.000        99.97
GET      56.000        99.98
GET      57.000        99.99
GET      64.000        99.99
GET     190.000       100.00
GET     200.000       100.00
---